app/controllers/menu_controller.rb

    def index
      @menu = Menu.where('menu_id is null')
---
SELECT `menus`.* FROM `menus` WHERE (menu_id is null)

    def show
      @menu = Menu.where('menu_id = ?',params[:id])
---
SELECT `menus`.* FROM `menus` WHERE (menu_id = '2')